{
  "info": {
    "copyright": "Copyright 2019 Open Connectivity Foundation, Inc. All rights reserved.",
    "license": "BSD-3-Clause",
    "title": "Water Info",
    "version": "2019-06-13"
  },
  "namespace": {
    "ocf": "https://onedm.org/ecosystem/ocf"
  },
  "defaultNamespace": "ocf",
  "sdfObject": {
    "waterinfo": {
      "description": "This Resource describes the water information to indicate type of water currently provided by the device. The water type can be read or set. The Property \"supportedwatertypes\" is an array of the possible water types are defined by the enumeration [\"cold\", \"hot\", \"ambient\", \"ice\"]. The Property \"supportedadditivetypes\" is an array of the possible additive types for water. The additive types mean optional types that can be added to the specific water type according to Client's preference and are defined by the enumeration [\"none\", \"soda\", \"mineral\"]. If absent, the default value is \"none\". The Property \"currentwatertype\" is the currently desired water type. The Property \"currentadditivetypes\" is the currently desired additive type(s). For example, if \"cold\" is selected with the \"currentwatertype\", \"soda\" and \"mineral\" or both can be selected as \"currentadditivetypes\". Note that if \"hot\" is selected with the \"currentwatertype\", \"soda\" and \"mineral\" may be restricted for the \"currentadditivetypes\".",
      "sdfProperty": {
        "supportedwatertypes": {
          "description": "The array of the possible water types.",
          "items": {
            "type": "string"
          },
          "writable": false,
          "type": "array"
        },
        "supportedadditivetypes": {
          "description": "The array of the possible additive types.",
          "items": {
            "type": "string"
          },
          "writable": false,
          "type": "array"
        },
        "currentwatertype": {
          "description": "Set the desired water type.",
          "type": "string"
        },
        "currentadditivetypes": {
          "description": "Set the desired additive type(s).",
          "items": {
            "type": "string"
          },
          "minItems": 1,
          "type": "array"
        }
      },
      "sdfRequired": [
        "#/sdfObject/waterinfo/sdfProperty/currentwatertype"
      ]
    }
  }
}
